# -*- coding: utf-8 -*-

# присвоюємо значення
lift = 0.36 # за користуванням ліфтом
rubbish = 0.12 # за вивіз сміття з особи
stock = 0.5 # формування ремонтного фонду
rent = 2.15 # квартплата

# площа квартири
# для ручного введення даних, використовувати команду input()
S = int(input("Введіть площу квартири: "))
# кількість проживаючих осіб
n = int(input("Введіть кількість проживаючих : "))

"""
для обчислення суми плати нам потрібно площу квартири помножити за користуванням ліфтом на м2,
за формування ремонтного фонду на м2, за квартплату на м2, і додати вивіз сміття з кількості проживаючих
у квартирі і створимо перемінну sums і присвоїмо йому значення відповіді
"""
sums = S * (lift + stock + rent + rubbish * n)
"""
функція round() заокруглює число до до найближчого цілого,
при використанні двох значень вказує до якого числа після точки заокруглювати
"""
print(round(sums, 2)) # виводимо результат на екран